//GPAZ99J2 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=CGPRG005
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
0014ELIS REGINA         F95MUSICA      08500950
0024ROGERIO CENI        M45FUTEBOL     03500540
0034MARIA E. BUENO      F80TENIS CAMPO 08000850
0044REI PELE            M75ED.FISICA   09800870
0055AIRTON SENNA        M55CORRIDAS F1010000950
99999999999999999999999999999999999999999999999
//*
