//GPAZ99J2 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=X1001PRG
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
1100SP1200200S97006790
1101SP0700300S38001060
2200MG0300200N53003840
2201MG0080100S12000850
9999999999999999999999
//*